In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')
with engine.connect() as con:
    rs = con.execute(
        "SELECT f.name, (CASE WHEN b.memid = 0 THEN f.guestcost * b.slots ELSE f.membercost * b.slots END) AS total_revenue FROM Facilities AS f LEFT JOIN Bookings AS b ON f.facid = b.facid GROUP BY f.name HAVING(total_revenue < 1000) ORDER BY total_revenue;")
    q10 = pd.DataFrame(rs.fetchall())
    q10.columns = rs.keys()
    print(q10)

              name  total_revenue
0       Pool Table            5.0
1    Snooker Table           10.0
2     Table Tennis           10.0
3     Squash Court           35.0
4  Badminton Court           46.5
5   Tennis Court 1           75.0
6   Tennis Court 2           75.0
7   Massage Room 1          160.0
8   Massage Room 2          160.0

In [3]:
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')
with engine.connect() as con:
    rs = con.execute(
        "SELECT surname, firstname, recommendedby FROM Members ORDER BY surname, firstname;"
    )
    q11 = pd.DataFrame(rs.fetchall())
    q11.columns = rs.keys()
    print(q11)

              surname  firstname recommendedby
0               Bader   Florence             9
1               Baker       Anne             9
2               Baker    Timothy            13
3              Boothe        Tim             3
4             Butters     Gerald             1
5              Coplin       Joan            16
6             Crumpet      Erica             2
7                Dare      Nancy             4
8             Farrell      David
9             Farrell     Jemima
10              GUEST      GUEST
11            Genting    Matthew             5
12               Hunt       John            30
13              Jones      David             4
14              Jones    Douglas            11
15           Joplette     Janice             1
16          Mackenzie       Anna             1
17               Owen    Charles             1
18             Pinker      David            13
19            Purview  Millicent             2
20             Rownam        Tim
21             Rumney  Henrietta            20
22             Sarwin  Ramnaresh            15
23              Smith     Darren
24              Smith     Darren
25              Smith       Jack             1
26              Smith      Tracy
27           Stibbons     Ponder             6
28              Tracy     Burton
29         Tupperware   Hyacinth
30  Worthington-Smyth      Henry             2

In [4]:
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')
with engine.connect() as con:
    rs = con.execute(
        "SELECT f.name, m.firstname ||' '|| m.surname AS Member, COUNT(f.name) AS bookings FROM Bookings AS b LEFT JOIN Members AS m ON b.memid = m.memid LEFT JOIN Facilities AS f ON b.facid =f.facid GROUP BY f.name, member;"
    )
    q12 = pd.DataFrame(rs.fetchall())
    q12.columns = rs.keys()
    print(q12)

                name            Member  bookings
0    Badminton Court    Anna Mackenzie        30
1    Badminton Court        Anne Baker        10
2    Badminton Court      Burton Tracy         2
3    Badminton Court      Charles Owen         6
4    Badminton Court      Darren Smith       132
..               ...               ...       ...
206   Tennis Court 2  Ramnaresh Sarwin        11
207   Tennis Court 2        Tim Boothe        52
208   Tennis Court 2        Tim Rownam         6
209   Tennis Court 2     Timothy Baker         7
210   Tennis Court 2       Tracy Smith         2

[211 rows x 3 columns]

In [5]:
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')
with engine.connect() as con:
    rs = con.execute(
        "SELECT f.name, m.firstname ||' '|| m.surname AS Member, COUNT(f.name) AS bookings, SUM(CASE WHEN starttime LIKE '%-01-%' then 1 else 0 end) as Jan, SUM(CASE WHEN starttime LIKE '%-02-%' then 1 else 0 end) as Feb, SUM(CASE WHEN starttime LIKE '%-03-%' then 1 else 0 end) as Mar, SUM(CASE WHEN starttime LIKE '%-04-%'then 1 else 0 end) as Apr, SUM(CASE WHEN starttime LIKE '%-05-%' then 1 else 0 end) as May, SUM(CASE WHEN starttime LIKE '%-06-%' then 1 else 0 end) as Jun, SUM(CASE WHEN starttime LIKE '%-07-%' then 1 else 0 end) as Jul, SUM(CASE WHEN starttime LIKE '%-08-%' then 1 else 0 end) as Aug, SUM(CASE WHEN starttime LIKE '%-09-%' then 1 else 0 end) as sept, SUM(CASE WHEN starttime LIKE '%-10-%' then 1 else 0 end) as Oct, SUM(CASE WHEN starttime LIKE '%-11-%' then 1 else 0 end) as Nov, SUM(CASE WHEN starttime LIKE '%-12-%' then 1 else 0 end) as Dec FROM Bookings AS b LEFT JOIN Members AS m ON b.memid = m.memid LEFT JOIN Facilities AS f ON b.facid =f.facid GROUP BY f.name"
    )
    q13 = pd.DataFrame(rs.fetchall())
    q13.columns = rs.keys()
    print(q13)

              name        Member  bookings  Jan  Feb  Mar  Apr  May  Jun  Jul  \
0  Badminton Court  Darren Smith       383    0    0    0    0    0    0   56
1   Massage Room 1  Darren Smith       629    0    0    0    0    0    0  123
2   Massage Room 2   GUEST GUEST       111    0    0    0    0    0    0   12
3       Pool Table  Darren Smith       836    0    0    0    0    0    0  110
4    Snooker Table  Darren Smith       444    0    0    0    0    0    0   75
5     Squash Court   GUEST GUEST       440    0    0    0    0    0    0   75
6     Table Tennis  Darren Smith       403    0    0    0    0    0    0   51
7   Tennis Court 1   Tracy Smith       408    0    0    0    0    0    0   88
8   Tennis Court 2   GUEST GUEST       389    0    0    0    0    0    0   68

   Aug  sept  Oct  Nov  Dec
0  146   181    0    0    0
1  224   282    0    0    0
2   40    59    0    0    0
3  291   435    0    0    0
4  159   210    0    0    0
5  170   195    0    0    0
6  147   205    0    0    0
7  146   174    0    0    0
8  149   172    0    0    0